In [4]:
import pandas as pd

In [5]:
df=pd.read_csv('F:\Salaries.csv')

In [6]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [9]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448841,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

In [6]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [7]:
df.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

In [8]:
df['BasePay'].mean() # Q1 Calculate the average base Pay?

66325.44884050643

In [9]:
df['OvertimePay'].max() # Q2 What is the highest amount of OverTime Pay in Salary Dataset?

245131.88

In [10]:
df['OvertimePay'].min() # Q3 What is the lowest amount of OverTime Pay in Salary Dataset?

-0.01

In [11]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']  #Q3 What is the Job Title of JOSEPH DRISCOLL?

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [12]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits'] # Q4 What is the Total Pay benefits of JOSEPH DRISCOLL?

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [13]:
df['EmployeeName'].groupby

<bound method NDFrame.groupby of 0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650         Not provided
148651         Not provided
148652         Not provided
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object>

In [14]:
df['TotalPayBenefits'].max()

567595.43

In [15]:
dmax=df['TotalPayBenefits'].max()

In [16]:
dmax

567595.43

In [17]:
df[df['TotalPayBenefits']==dmax ]['EmployeeName'] #Q5 What is the name of highest paid person including benefits?

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [18]:
df[df['TotalPayBenefits']== df['TotalPayBenefits'].max() ] # Q6 List the details of highest paid person including benefits?

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [19]:
df[df['TotalPayBenefits']== df['TotalPayBenefits'].min() ] # Q7 lowest paid Employee?

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [20]:
gp=df.groupby('Year')

In [21]:
gp['BasePay'].mean() # Q8 Average base pay of all employees per year (2011-2014)?

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [57]:
new=df.groupby('Agency')

In [22]:
df['JobTitle'].nunique() # Q9 How many unique Job Titles are there?

2159

In [23]:
df['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [24]:
sum(df[df['Year']== 2013 ]['JobTitle'].value_counts() ==1) # Q 10 how many Jobtitles were represented by one person in 2013?

202

In [25]:
sum(df[df['Year']== 2011 ]['JobTitle'].value_counts() ==1) # Q 11 how many Jobtitles were represented by one person in 2011?

200

In [26]:
sum(df[df['Year']== 2012 ]['JobTitle'].value_counts() ==1) # Q 12 how many Jobtitles were represented by one person in 2012?

190

In [27]:
jbt=df['JobTitle']

In [28]:
jbt

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148649                                         Custodian
148650                                      Not provided
148651                                      Not provided
148652                                      Not provided
148653                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148654, dtype: object

In [31]:
if df['JobTitle'].str.extract('([a-zA-Z ]+)', expand=False).str.strip() == 'Chief':
    print(df['EmployeeName'])

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [36]:
newstring=df['JobTitle']

In [45]:
df['JobTitle'].str.findall('Chief').value_counts()

[]         148231
[Chief]       423
Name: JobTitle, dtype: int64

In [47]:
df['JobTitle'].str.findall('CHIEF').value_counts() # Q 13 How many people have the word CHIEF in Job Title?

[]         148450
[CHIEF]       204
Name: JobTitle, dtype: int64

In [56]:
df['JobTitle'].str.findall('CHIEF').value_counts()

[]         148450
[CHIEF]       204
Name: JobTitle, dtype: int64

In [59]:
df['JobTitle'].str.findall('Captain').value_counts()

[]           148243
[Captain]       411
Name: JobTitle, dtype: int64

In [17]:
def chief_string(x):
    if 'chief' in title.lower():
        return True
    else:
        return False

In [18]:
sum(df['JobTitle'].apply(lambda x: chief_string(x)))

NameError: name 'title' is not defined

In [12]:
df['title_len']=df['JobTitle'].apply(len)

In [15]:
df[['title_len','TotalPayBenefits']].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

In [19]:
df['title_len']

0         46
1         31
2         31
3         36
4         44
          ..
148649     9
148650    12
148651    12
148652    12
148653    26
Name: title_len, Length: 148654, dtype: int64

In [21]:
df['JobTitle'].str.findall('chief').value_counts()

[]    148654
Name: JobTitle, dtype: int64

In [ ]:
df['JobTitle'].str.findall('Chief').value_counts()